[
  "It's very disturbing that the backing track of the lead is running along. They are not in sync. In terms of balance, it's not a bad mix overall, but I just can't listen to it. It irritates me immensely.",
  "Too much drums/vocals, too few guitars, especially the melodic guitar.",
  "The mix lacks presence in the vocals. Due to the loud cymbals, you would expect the vocals to be EQed to sound 'fresher.' In mono, the mix loses some of its strength, and the uncontrolled vocals are particularly noticeable.",
  "The mix sounds quite empty. Perhaps make more room through EQ?",
  "vocals get lost in places",
  "Very narrow stereo width, vocals are too prominent",
  "barely can hear drums. voice it too present and not improved.",
  "Too much rev, where have the vocals gone?",
  "the voice stands a bit too much",
  "maybe the EQ balance affected and mixed all these sound sources together, not bad",
  "This lacks punch as well, although I find it better than the first two. The whole mix is not very loud and the guitar is not distinctive enough",
  "some delay effect",
  "Bit too much hi-hat/overheads.",
  "Hi-hat is louder than the rest of the drum kit, which is a bit bothersome to me. Again, the vocals seem to fade away a bit.",
  "Drums a bit too loud and vocals a bit too quiet in the verse",
  "Vocals are a bit too quiet, the bad sound of the guitar recording is very obvious here",
  "Punchy and clear mix but too much drums especially during intro of the verses. Not sure the selected reverb for the vocals fits the recording (too roomy). Panning could be better used to spread things more in the sound field.",
  "Vocals hard to hear. Weird reverb going on.",
  "This one is like a soup of tracks",
  "Distant vocals create a muffled effect and for a pop/rock track this is not a desirable outcome. Vocals should have been placed a lot more in \"front\". This makes it a poor mix but instruments seem quite balanced otherwise",
  "sounds like the vocal is far away from me, maybe it ought to increase the volume of the vocal part",
  "There is a bizarre reverb on this one, as if it was already played in a specific room. The instruments are covering the vocals too.",
  "drum is grate / some delay effect",
  "The vocals stand out significantly above the mix; they almost overshadow the guitars completely. In the chorus, everything fades away except for vocals and drums; the musical aspect almost disappears, which is a bit unfortunate.",
  "There is time invested in this mix, with a lot of effects and vocals pushing the rest to the background. Guitars are not audible at all. I find it to be a poor mix.",
  "Too much vocals, too little guitar, excessive effect during the choruses.",
  "Few guitars, a lot of vocals with not so pleasant EQ, but it sounds open. A gap in the low-mid.",
  "The vocals are too loud, and there's a lack of drums and bass, especially in the chorus. If the vocals were less loud, it would solve a lot.",
  "Mix sounds a bit thin.",
  "Where is the band? It is vocals only, in a pool of reverb",
  "The voice has too much reverber and it has a too much higher volume compared to the other instruments",
  "Too much reverb and the vocals are too predominant. Too much air/HF on the hi-hat which is too loud, tiring for the ears. Weird delay on the vocals in the chorus.",
  "dreamy, edgy at high, voice far too prominent and screaming - rough",
  "voice is too much present. it sounds much more than the instruments. moreover i can't barely listen the guitar. I can hear the echoes of the singer in the room",
  "Sounds like i solo'd the vocal reverb track...",
  "Too much reverb. Bass isn't very well defined. Neither is the kick.",
  "too much on the reverb",
  "Vocals are clearly too loud and the space design used here therefore seems too much too. Although it could be due to everything else being so quiet. The rest of the mix is being severely affected when vocals are in and even if they were mixed well vocals is affecting what we hear a lot negatively",
  "Vocals are too present compared to the instrumental behind",
  "Bit too bass-heavy, guitar barely audible, vocals seem to artificial",
  "vocal is harsh",
  "Vocals are quite dry in the mix and very transparent, maybe a bit too much in the foreground during the choruses.",
  "Too much kick/snare, vocals too quiet in the verse.",
  "Vocals are quite dry in reverb, a lot of high frequencies, energy comes across well.",
  "The vocals sound quite dull. More highs in the mix?",
  "The vocals lack some effects and are a bit too quiet in the verses compared to the chorus. The song sounds clear, and the proportions are right. The guitars might sound a bit too thin.",
  "Drums a bit too loud and vocals a bit too quiet in the verse",
  "Voice is too quiet, guitars are too loud",
  "The voice is too low compared to the other instruments",
  "mixed by a bass player?",
  "This lacks a bit of punch, and there seems to be an EQ effect on it that makes it sound a bit distorted/played over bad speakers",
  "Bass-heavy",
  "instrument volume is too loud",
  "I hear a lot of vocals, a bit less guitar, and somewhere far back, drums. There's little definition, and unfortunately, I don't hear any effects.",
  "Too little drum (way too few toms).",
  "Sounds quite LoFi.",
  "The mix lacks focus in its balance choices: I don't know where to listen... In the verse, where the vocals are not very intelligible (which doesn't contribute to the emotion and is somewhat frustrating), they are suddenly placed loudly in the chorus. The choice of the snare sound is interesting but is too static to fulfill its role as an anchor. In mono, the mix loses a lot of its strength, and the strange balance choices become more apparent.",
  "Many guitars, strange EQ especially in the midrange, making it sound like it's coming through a radio.",
  "Guitars sound a bit messy at times but are audible. Vocals are not very clear at the beginning. In the chorus, the vocals come in quite abruptly and are too loud, which I don't find pleasing. The vocals are not deep enough in the mix during the chorus. I miss a bit of sub and cymbals. The balance of the drums is not quite right; cymbals and toms are too quiet compared to the kick and snare. The balance could be better overall.",
  "Lacking body, vocals get lost in the mix. Quite dry.",
  "This mix could use a bit more brightness. In my opinion, the drums don't bring enough energy as they are now. It sounds somewhat dry, and I miss some punch in the drums.",
  "Too few drums. The guitars are prominent but don't sound good, not clear. The vocals could also benefit from sounding clearer with more effects.",
  "Vocals too low. Guitar too loud. Generally very poor balance.",
  "No bottom end, no high end. All midrange. Vocals are hidden behind the too-loud guitars",
  "Everything is too compressed, there is lack of dynamics, and it is too filtered, in particular low frequencies are too filtered",
  "too much cutting -",
  "sounds like everything is mixed from just 1 mic (singer's mic)",
  "Tinny with no bottom end...",
  "Doesn't get very clear until the vocal vocal bursts through. Guitar hard to hear correctly.",
  "\"Old tape\" mix?",
  "Attenuated frequencies at low and high end and mix centred around mid frequencies.Low level of excitement. Some grouping seems to happen between guitar and drums as the guitar sound seems to be cancelling the drums in the beginning.",
  "the vocal sound is too vague, and it sounds like lack of some harmonies.",
  "Sounds muddy",
  "guitar and drum is weird",
  "Vocals too high and dry - sounds flat and lifeless.",
  "A little tinny sounding",
  "Something's wrong with the eq on this one?",
  "That mix seriously lacks punch, I guess the drums should be more present",
  "Vocals a bit too much \"excited\" by some kind of tube-modelling",
  "Bad, unnatural midrange, sounds like an mp3",
  "The voice is too compressed should have a higher volume",
  "Low-pass filtered. Lost of definition. Feels like a highly compressed (in the audio coding sense) version.",
  "underwater",
  "doesn't sounds clear. very poor mastering",
  "Quite heavy and very dry vocals.",
  "Vocals a little lost in the drums.",
  "the vocal sound is a little bit vague",
  "Guitar/bass instruments sound \"fragile\" / dampened and fuzzy. Sounds like listening through a radio",
  "channel balance is kind of weird",
  "Vocals too distant due to the choice of reverb and also due to poor equalization, bass lacks presence, Hammond too loud at times.",
  "Mix lacking brightness overall. The stereo image is a bit confusing in the drums.",
  "Vocal seems to be coming out of a car radio... Very mid mix.",
  "Excessive drum presence and excessive use of reverbs. The drum elements sound distant from the musical field, just like the guitars are overly present for this formula. Lack of brightness in guitars and vocals. Excessive midrange in vocals. Lack of gain automation in vocals. Bass is missing.",
  "Guitars with excessive midrange, vocals lacking presence.",
  "Reverb too present. The mix loses strength by having too much space.",
  "Seems like i'm hearing this out of a tape deck.... I need to tilt my head to listen to this one... bad panning..",
  "Voice with too much reverb becomes too hidden among the other elements. Effect on the guitar doesn't help the mix. Too much reverb on the snare. Everything sounds very distant and lacks power.",
  "Excessive treatment of the vocals, creating a strange plasticity. Excessive presence compared to the other elements. We can't hear the other pieces of the drum kit besides the mid-highs from the overheads. Good bass balance. Excessive presence of the pianos.",
  "The drums should be more present; the bass is a bit too loud. The vocals have an excess of highs.",
  "The time-based effect on the vocals doesn't complement anything. Guitars are not very present. Lack of volume in the drums.",
  "Mix is quite boxed. drums and bass are so low and masked. some weird things are happening to the vocals. Again the keyboards seem to stand out.",
  "The effect on the vocals is too much. The mix, in general, is too muffled. The vocals are too prominent in the more intense part of the song. The drums are very hidden. It lacks enough strength to carry the song when needed.",
  "Excessive presence of keyboards and vocals. Guitars with a very strident tone. Excess of hi-hats in the chorus. Drum details are not heard with precision (lack of compression and gain boost).",
  "Weak mix, excessive overheads, poorly equalized snare, vocals lacking presence.",
  "Vocals are not well defined and lack presence. The synthesizer is detached from the mix. And there's a lack of body in the guitars and drums.",
  "It seems that someone forgot to mix this one. A lot of keyboard,",
  "I miss highs in the vocals. Too many mid-lows make the mix 'boring' and heavy. Crash cymbal is too loud in the chorus.",
  "Excessive drums, vocals, and backing vocals (especially in the chorus). Lack of work on the vocals (applying EQ to add more brightness, compressor to give more dynamic presence, and reverb to simulate the room that the original studio lacked). Missing guitars and bass lines.",
  "Bass not very present; vocals with an excess of midrange.",
  "The mix lacks a bit of strength. Background vocals take up too much space that belongs to the main vocals. The keys with delay add an interesting space.",
  "Needs a bit more vocals. The vocal seems a little dead. Drums don't have any punch to them. Guitars are a little \"low middy\". Back vocals are too loud when compared to the main vocal.",
  "The vocals could be a bit louder and slightly less dry. The keyboard element could be a bit higher in the verse to add more dynamism to the music. Drums in general could be louder, but paying attention to the cymbals. Choruses in the chorus are too loud. Crash cymbal too loud in the chorus.",
  "Excess midrange and the presence of overdriven guitars, perhaps due to the gain or pans excessively leaning to the left. Snare, toms, and kick drum have no presence in the mix, at the same time, there's a certain exaggeration in the presence of hi-hats in the chorus. The mix lacks body, needs EQ and compression on the Final Mix channel.",
  "The drums don't have any room to them. The vocal is quite low and masked by the other elements. the back vocals need to be tighter, and they seem to disappear in the mix. Mix tends to the left. The guitar in the middle 8 is quite loud.",
  "The definition of the elements helps to understand the music better. Guitar too loud, especially from the pre-chorus, stealing attention from the vocals. The vocals are not very present from the pre-chorus. Crash cymbal too loud in the chorus. If the vocals were slightly higher in the chorus, the mix would be, in my opinion, more balanced.",
  "Attempting to pull the guitar to the left highlighted it compared to the rest of the instruments, making things a bit strange. The vocals are not pleasant to listen to.",
  "The guitars and vocals are too loud compared to the rest of the instruments, making the predominant tone the midrange of the guitars and vocals, which makes the mix a bit aggressive. Despite the guitars being open (stereo), overall, the mix is not benefited because all the other information is too centered. The use of reverbs, especially on the drums, puts all the instruments quite distant and very separated, it doesn't seem like they are playing together.",
  "The spatialization helps the music. However, the processed vocals create something bizarre. The instrumental guitar section lacks body and highs: it becomes too thin...",
  "- Drums could be higher (especially kick and snare drum) - Solo guitar too high (compared to base guitar)",
  "Worst of the mixes, vocals with excessive effects, I can't even quite describe what it is. The bass seems to be the best within everything.",
  "The voice sounds strange, muffled, and the tambourine is too loud compared to the rest.",
  "The chorus should have compression to avoid so much variation. Chorus and vocals should be less present. And the voice is processed in an unorthodox way. There is a bright percussion instrument too present.",
  "The volume balance between instruments is quite unbalanced. The kick and snare are too loud compared to everything else. The use of reverb on the guitars makes the whole melody quite confusing and in a different space from the instruments. Overall, the mix seems very closed, with too much bass and little definition. Throughout the song, there are too many fluctuations in the dynamics of the voice, causing some words to be lost slightly at times.",
  "The drums are too muffled, the vocals lack interest. The drums are too loud, and the snare lacks definition.",
  "Not only the excessive reverb on the vocals, but they also panned the vocals to the L and R, making things even stranger.",
  "The volumes between the instruments are unbalanced, especially in the relationship between guitar, vocals, and snare. It has a lot of information in the center, making the mix a bit cluttered and lacking space. Timbrically, the mid-bass area is too filled, making the mix a bit cluttered and unclear. The use of effects, especially on the guitar, made its sound unclear and placed it slightly apart from the rest of the band. Overall, if the effects were improved or reduced, the mix would sound better.",
  "The equalization of the vocals is strange. It seems concentrated on the higher frequencies only.",
  "The vocals and guitar are louder than the rest of the instruments. All instruments seem overly processed and equalized, the mix lacks body. Especially the vocals have only high frequencies. The music has little dynamics and is overly compressed. All instruments seem centered, making the mix less interesting and small. Overall, the whole song feels distorted and overly filtered.",
  "- Missing some bass to the final mix - Back vocals too high - Bass guitar too low (could be higher and more powerfull) - Guitar too much on the right - Missing some reverb to the vocals",
  "Seems very compressed. The voice lacks any life. It sounds like it's compacted.",
  "I dislike an element of the drums that I can't identify, even listening to the other songs. It's present and a bit bothersome. A sound that seems like a 'scratching' of some sort. The guitar is a bit muffled.",
  "the panoramas don't satisfy me: the accompaniment of the voice shouldn't have been spatialized. The choir could have been stronger. The soloist's voice could have been worked on more.",
  "The bass is too low. It ends up overshadowing some of the other instruments.",
  "The vocals are too loud compared to the other instruments, and the drums are slightly low. The mix is somewhat muddled in terms of frequency and lacks definition. All sounds are heavily compressed, causing them to lose some character and timbre. The spatial aspects are underutilized, making the mix less engaging and confusing. Overall, the mix lacks more definition and presence in the low and high-frequency areas.",
  "Excessive vocals, pianos, and backing vocals in the chorus. Lack of presence in the drums (except for the overheads). Lack of equalization and compression work on the Mix Output to generate more weight and strength in the mids and lows. Lack of brightness and reverb in the vocals.",
  "Mix is a bit muffled. Keys are too prominent.",
  "Vocal is too low and needs a little less reverb.Keyboards are too loud, causing some pumping effect. Drums seem to be in the right place. Guitars seem ok. Keys sometimes cover the voice up.",
  "Voice is too muffled and low. The tail end of reverb in the voice is too audible. Keyboards might be a bit too loud compared to the guitar.",
  "Complete lack of low frequencies. Sounds like a low-quality stream. Despite that, in terms of overall balance, it seems interesting. Lack of bass presence. Excessive pianos in the chorus. Needs better work on the vocal lines (reverb and gain automation in the parts leading up to the chorus).",
  "Excessive mids and highs; kick almost not felt; snare lacking mid-lows; vocals",
  "Drums are well present. Mix too strident. Lacks body.",
  "Guitars are too bright, without low end at all, sound to thin. The vocal is quite thin also. The bass is a bit low, needs a bit mor roundness. The drums seem to have a bit too much room when the snare hits.",
  "The voice is too prominent and dry. The tambourine is too loud, stealing attention from the other elements. Low frequencies are not prominent enough. I miss the secondary voices that hold the music together between verses.",
  "Excessive presence of the main vocal for this mix, but it shows a good balance in the VOICE group and the INSTRUMENT group. There is a lack of balance application between these two groups.",
  "Very weak mix; low frequencies lacking presence, guitar clashing with the main vocal, tambourine too loud.",
  "Voice too loud and separated from the mix.",
  "Voice with too many mids, sounds too muffled. Tambourine too loud. A better balance between guitar and keys during the verse might help for a fuller sound. Snare drum very hidden.",
  "Terrible application of vocals throughout the track. Excessive presence of both vocals due to overly elevated panoramas. Vocal1 - left / vocal2 - right. Other elements, especially the drums, are too suppressed, lacking color and brightness. Insufficient dynamics between guitars and bass. Lack of low frequencies and definition in the bass. Missing equalization and compression in the guitar. Excessive panning in the guitars.",
  "The reverb is noticeable on the sibilants. The drums lack definition.",
  "What is happening to these vocals? This mix just seems to have no center. What is going on here? Very creative mix indeed. Terrible balance.",
  "The center becomes too empty when the vocals pan to the right and left. Panorama should be less extreme. The voice is too low during the first part of the song. Snare disappears in the second part of the song.",
  "I like the balance but the vocal is out of control, needs automation and maybe tuck it in a bit. Snare sounds dull and every hit is different. Organ is a bit too wide, not natural",
  "Not enough kick. Verb pushing the vox back too much. Pick a different vox verb.",
  "Like the low end punch, need more pop from the snare.",
  "Reverb",
  "bad drum sound - bad lead vocal mix",
  "don't like the vocal ambience that much",
  "bad phase,",
  "Horrible vocal verb. Horrible verbs in general. Drums have a bit of punch at least. Balances OK. Vocal needs leveling.",
  "This vocal verb, I don't think it matches the voice.",
  "Guitar is too prominent, mix is too trebly",
  "reverberant",
  "Vocals are low, and diluted in a reverb with a lot early echo. This is really not helping them to cut through and to be intelligible.",
  "Vocals a bit too loud. Quite a harsh mix.",
  "The vocal sound is lolder compared track 2 and track 0",
  "Too much compression on drum.",
  "Terrible resonance in the low mids, please kill it and burn the body. Vocals too loud and the instruments are a mess.",
  "The vox is loud, but everything else is too quiet. Where are the drums? Can't hear the kick.",
  "Missing some presence on the acoustic guitar and punch from the band. A little wet too.",
  "dark and boomy; almost cannot hear drums",
  "Inappropriate reverb. Weird L&R image. No high end.",
  "where are the drums? seriously. Nasal vocals.",
  "both guitars up the middle. too much voc reverb. crazy rhodes treatment. where are the drums? 1 800 drums? long distance please come home in time for dinner....",
  "not a mix in any sense of the word. drums ridiculously low. too much verb on vocal and kbd.",
  "no drums? drums too low",
  "The reverb on the vocal doesn't fit, and the guitar and keyboard could come up a bit more.",
  "weird phase in bass",
  "Drums WAY too low. Vocal verb is way too loud. Too much verb overall, no definition. Vocals too loud. Balances are all wrong.",
  "too much vocal",
  "Sound like I'm in a church - very incongruous reverb.",
  "Drums too far, really weird balance. not good.",
  "inst. seem distant/muddy",
  "Where are the drums?? Totally out of balance, all I hear is high hat, maybe a little snare. Verb is washy.",
  "Reverb on the keys makes it soupy. Vocal level a little upfront this big roomy thing behind it.",
  "Drums too quiet (especially kick).",
  "Reverb and voice a little high.",
  "This is an unorthodox mix. But the effect of muffling the backing instrumentation very nicely serves the lead vocals on the verse. It would be interesting to open the sound a little more on the chorus, that fails to get the lift it needs. There are strange abrupt volume changes in the instrumentation of the chorus. Caused by a bad balance of the ride cymbal vs. HH ?",
  "Too much reverb",
  "the voice too ahead",
  "Less low frequency.",
  "vocals dominant,",
  "would like it wider. music feels very low, vocal is VERY up front. the rest of the music doesn't",
  "woofy bass and organ",
  "need more reverb for reverb and too much low end in the middle",
  "too much rhythm section (especially kick & bass), vocal gets lost sometimes in the verse. missing a supportive vocal verb, but it'd come across better if the vocal were higher / ridden. and i think i hear too much mix bus compression.",
  "Punchy bass and kick way too loud, overwhelmes the vox.",
  "vocal too soft, could be more compressed, too dry, too dark overall",
  "Super dull. Weird drums and acoustic and vocal.",
  "kick drum too hot, and thick - help!",
  "kick and bass out of perspective (and too loud)",
  "too much kick drum",
  "I feel the keyboard and guitar are distracting because they are panned very far, which really makes them sound too big. This isn't aggressive rock and roll, but the kick seems to think so.",
  "too much bass",
  "Do you hate high frequencies? Way too dark. Weird stereo verb on the guitars, kills the definition. Too much kick. Vocal a bit too quiet.",
  "Vocal is hidden comparative to the other tracks",
  "punchy but way too boomy and super mid heavy",
  "Balance a bit off.. keys are too wide, it's a little nauseating. Low end a little muddy.",
  "Something is wide and phasy and distracting me. Vocals too dry, needs to presence. Kick sticks out. Bass is muffled.",
  "Way too much bass and not well equalised. Generally poor balance.",
  "Vocals too quiet",
  "dummy vocal",
  "Not enough high end in general in the instruments. Sounds muddy, but punchier than Track 8. Bass Guitar too strong.",
  "This bass don't fit well in this song.",
  "Spectral balance massively biased toward its low end. Mix is therefore too boomy. Bass drum microphone is way too loud.",
  "Vocals a little quiet, lacking impact, but a subtle mix.",
  "Drums lack impact. Subtle mix.",
  "too much low",
  "vocal is too stuffy",
  "Dull acoustically",
  "Noise.",
  "It sounds a little muddy.",
  "dig the vocal fx and lo-fi-ness. guitar is too loud and the keys are harsh. side by side with other mixes it falls flat. i like how the drums & bass are presented as a unit, but needing more of them and less of the upper rhythm instruments.",
  "The vox effect is not doing any favors.",
  "goofy voc treatment - am radio? snare is clear, but kick is lugubrious...",
  "fucked up loop (delay) and verb on lead. no support in instruments for vocal. kbd / gtr groove too spread.",
  "vocal effect doesnt really work",
  "I don't like the vocal verb, but you went for an effect which is fine. Drums are flat and lifeless, no punch at all. Not enough snare. Guitars too loud sometimes.",
  "mono vocal effect doesn't really work for this tune",
  "cool effect on the vocals for a special use, but not the full song. Guitar is distorting and sounds like a plastic box (super midtastic)...not a good thing. the rest is very thin",
  "This sounds really amateurish - a lot of EQ problems, and that rediculous verb is not helping the singer or the song.",
  "too much FX?",
  "Don't like radio voice.. bass needs a little more level. Weirdness in stereo imaging.",
  "vocals too soft and muffled. But I like the delay effect.",
  "Don't like vocal eq and delay sound.",
  "Uncomfortably thin vocals and guitars are too prominent",
  "reverberant",
  "Mixing for a specific kind of music.",
  "Is the vocal filter a way to get them to cut through the guitars that are too loud? The drummer's inconsistencies of loudness hit on the snare could be corrected.",
  "Vocals very wet / too much compression.",
  "Too much distortion on the vocals.",
  "I love this song ,but not this track, it is electronical and anamorphic.",
  "'Phone call' effect on voice, sounds very bad and low quality reproduction. Also nasal effect on voice",
  "the big space",
  "Distorted.",
  "vocals most recognisably distorted/edited in this track",
  "vocal it's really dry, bass has too much low end",
  "Muddy. Need more presence/punch from ryhtm section, vox too loud in comparison",
  "too much bass, overall a bit dry, kick too loud, the rest of drums too soft",
  "Undefined bass, weird EQ on vocals.",
  "dry vocals, also something inhigh mids in voice, drums distant",
  "very dry voc, guit too loud - crazy compression on this one.drums much too low",
  "not a good drum mix & sounds (weird snare). ld vocal needs better context (with verb or something) and better rides",
  "vocal too dry",
  "The guitar is too loud in the mix. It should have already been already be under the rest of the mix.",
  "really dry, guitars cut too much in verse",
  "over compressed, no groove",
  "too dry - doesn't sound like one performance",
  "Low end needs work. electric guitar is too loud. vocal EQ has some problems, sound phasey some times - not helping. Also, if the voice is going to be that dry, you need to work harder on your automation.",
  "Weird low end and low mid heavy, too much! Meeh.",
  "vocals are a bit dry/low",
  "vox a bit too loud. need wetter vox. rhythm instruments too loud. drums need to be louder. bass needs more definition.",
  "Guitar too loud. vocal very dry. Generally not well balanced.",
  "Too much guitar, it dominates the vocal",
  "Sounds like there is some noise in the background with the groove.",
  "Sounds a little crowded. Guitar track requires more compression.",
  "Vocals a little dry.",
  "too much mid-high",
  "Sounds generates form a close place. Too close maybe",
  "Voice suffers from not enough reverb compared to the rest of the mix",
  "voice sound like not match the melody",
  "Plain.",
  "Too much low frequency.",
  "sounds flat, a bit confusing how instruments come together, sounds more harsh",
  "Instrument balance sounds wrong to me, drums are in the back in the begining and in the end they're too loud. There is a resonance in the low mids that clouds up the mix. Vocals get to loud and then go back.",
  "not right reverb for the vocal and other instruments need to be more louder compared with vocal",
  "Very verby, don't like the decay. Vox is muddy.",
  "Drums seem a little carved out of something. I need some more meat from that snare.",
  "too long vocal reverb with weird color",
  "terrible vocal reverb(broken plate), kik lack definition, vocal sits weird",
  "another wierdo vocal reverb. hihat is roomy sounding. overall obscure mix",
  "top drums too light; kick too loud for bass level / sound. vocal verb not in perspective.",
  "The verb on the vocal is wrong and doesn't really fit the song, but I feel the instruments are glued well together, and the vocal is the still the main focus.",
  "weird mids, vox too up",
  "can't hear all the instruments well. voice is too far up and distorting in level. poor multichannel balance",
  "Lo-fi? Drums seem very weak, except the kick, which seems out of place. Then in the chorus you need to calm the drums down and keep them in the mix, same with the vocal at the end.",
  "Weird scooped vocal sound.",
  "seems a bit all over the place",
  "toms a bit too loud, low tom especially not well balanced. Bass it a bit low.",
  "Soft instruments. Guitars too distorted, should be cleaner to match the softer overall mix.",
  "Too much reverb, especially on vocals. Rack tom mic is way too loud.",
  "Vocals very prominent. Punchy drums. Guitar too quiet. Lacks subtlety.",
  "voice too loud",
  "Rhythmic.",
  "Too much distortion on guitar.",
  "Vocal is a bit low, very messy mix. Bass lacks definition. Organ is taking too much space.",
  "too much low and wiered reverb for vocal, not balanced.",
  "vocal too soft in the verse! weak drums",
  "voc much too low. guit thick bass nondescript",
  "lead vocal not mixed well. bass too loud.",
  "The vocals need to be louder, the guitar is overpowering her voice because it's louder, and put over her voice.",
  "Like the vocal delay, drums not quite as present as #5, bass a little murky",
  "Hashy bad groove",
  "too thin",
  "Lows are cloudy. Vocal verb is pushing her too far back in the perspective.",
  "Weird since the beginning, gets boring.",
  "vox a bit low, guitars are too hot?",
  "Vocals too soft. Muddy low-mids.",
  "Bass not well balanced, too loud and muffled.",
  "Too bassy, not enough vocals, guitars too prominent",
  "Really like the strong guitars, however they are spread out during the chorus, becomes a bit messy. Vocals lost in verse. Drums not strong enough, but like the clean nature.",
  "Sound of instruments too high.",
  "Vocals are very far behind. This is bad. Mix is a bit too boomy on top of that.",
  "Vocals a little quiet / dry.",
  "A little noisey and muffled.",
  "too much mid, not good balance",
  "Voice too quiet. Slightly too much reverb",
  "the instrument's sounds too loud,can't hear the voice",
  "Distant.",
  "Less fulness.",
  "a bit muddy",
  "vocal gets lost in the hook. its quite low in the verse as well. bass could be higher, or morseo, the guitar could be lower, sounds quite loud in the left channel. the backing vocal comes in louder than the lead.",
  "too much reverb for vocal and not balanced with other instrument",
  "Verby, not enough presence on the vox. Everything washes together.",
  "way too much reverb!",
  "guitar in the left is too present, too much reverb",
  "bathroom reverb - very bad approach... will never get on the radio",
  "way too much verb on vocal and too damn long. bad mix perspective",
  "too much reverb",
  "Too much reverb on the vocal, also on the left side there is something that cuts in and out in the first few seconds. Too much sizzly reverb on the overheads.",
  "too much verb!",
  "Way too much vocal verb. Drums flat and lifeless. Guitars OK. Too much verb overall.",
  "too much reverb, not fitting the song",
  "Dude, where am I? Way too spaced out and sounds like a room mic in a club and that's it. not good",
  "Vocal reverb is very incongruous.",
  "too much verb/FX on vox",
  "Too much reverb on vocals. instruments don't gel very well (vocals and guitar vs drums).",
  "Sounds like it was recorded in a cathedral",
  "reverberant",
  "Like the reverb length and style, however Vocals get lost in the mix. Hard to distinguish some words",
  "Too much reverb.",
  "Too much reverb on the vocals.",
  "sounds like singing happening in a big closed room.",
  "Far too much reverb. Weird resonances in mid-to-high frequencies",
  "the voice feel too far",
  "Too much reverberation.",
  "distortion in the ... left channel is quite distracting. reverb is nice. on the right its very distracting. openness is nice. wait, too much reverb. the more i listen to it, the wilder it sounds. the instrument on the left is really quite distracting and it sounds unbalanced. too much reverb, especially on the chorus",
  "Vocals too loud, plain mix. If that was not made by a robot, that person has no soul",
  "Sounds a bit thin in spots, more drums (kick!!)! Compression on main vox a little weird. Work on overall EQs",
  "vox too loud. guitars too quiet. overall too mono and not very bold.",
  "weak low end, too loud vocal",
  "voice is too dry, although it sits nice in the mix - chorus doesn't hit hard enough, no forward motion",
  "strange phase treatment on guitar in verse. voc dry?? bass light and kick as well.",
  "Snare out of phase with OH's? LD V and LD V answers too loud, need perspectiveEPno out of phase L to R",
  "drums sony tiny, no punch at all. Vocal too loud. Chorus everything masks everything, needs work.",
  "A little thin sounding? Phase issues with drums?",
  "Snare drum is too weak and does not have enough body. The backing vocals are treated just like the main line, so they interfere in a bad way.",
  "the lead vocals are too forward and not balanced well with the background vocals",
  "vocals not so mixed with the other instruments",
  "lack of depth compared to others, leading voice very in front. Maybe some reverb would have made it slightly more interesting.",
  "Where have the band gone? Vocals only? - some odd phasing at points.",
  "Vocals too loud.",
  "the second voice is a bit too hidden under the first",
  "muffed mix, a bit thin",
  "Voices too high in the first part. Dry in general, and the drums too direct (the snare kick is unpleasant)",
  "i don't know. needs a lot of EQ.",
  "a little dry. not enough low end.",
  "a bit too dry and weak drums",
  "Drums have too much compression - voice is a little boring, maybe too compressed - Good balance",
  "Verse has interesting Track / Drums, but too narrow, no lows, no OH's; not enough EGtr in V's. LD V balances not consistent. in V's EGtr too soft / LD V too loud in C's the opposite",
  "Missing high frequencies, vocals too loud, stereo image very narrow",
  "vocals a bit dry",
  "only voice and bass, lack of surrounding and envelopment - too sharp. Poor compared to others.",
  "compressed mix",
  "Drums too high in general, voice too low in second part.",
  "drum’s sound too loud. The reverb is not strong enough.",
  "this mix lacks hierarchy",
  "The singer's voice is kind of stuffy, warm and wet. The instruments is the secondary but supersedes the primary (vocality).",
  "vocals a bit crunchy? bit too much verb & on the thin side (more bass & kick)",
  "Verb on vox a bit much, sounds kinda harsh. Platey! Needs some work",
  "no bass. no kick. no like. singer is in a bathroom.",
  "too weak drums and guitars, too loud vocal, too much compression",
  "Voice Sounds empty, Nasal - bass is low - reverb is distracting - chorus doesn't hitStereo Image is nicely managed",
  "whole shebang out of balance (who the FUCK mixed this)LD V and LD V answers not integrated with any kind of mix",
  "Funky vocal verb. Very thin & emaciated sounding...",
  "Too much verb on vocals. Drums EQ pretty bad.",
  "Too much reverb on vocal. sounds out of context!",
  "vocals are too forward in relation to all other tracks.",
  "sound too much to the front, no background",
  "Vocals too loud and reverb obvious. Detracts from any good mixing practices that might be there",
  "What! Nasal verse vocal, no band dynamics, its all flat with vocals that are too loud.",
  "Phasing issues on the vocals I think or else too much reverb.",
  "too much reverb on the voice",
  "could have less reverb on vocals",
  "Too much reverb for the voice in the 1st part, guitar too low. 1st voice is plain over all the song .",
  "the sense of space is too strong.",
  "I like/hate the compression on the snare. Snare vanishes in the chorus. Guitars are thin which makes the chorus a little weak.",
  "OVER compressed snare. Weird balance; no real definition on all the instruments.",
  "snare is a little loud, stereo guit is a little boring, sounds band limited",
  "weird snare compression bad LD V balances, especially bad in Choruses",
  "Oooo, let me hear that snare compression!",
  "Back vocal panning is sort of cool, kind of cheap. Guitars sound horrible, thin and inappropriate for this song. Drums disappear in chorus. Verse OK but chorus horrible mix.",
  "Drums too loud. Badly balanced",
  "When the distorted guitars kick in they are too prominent, overall it lacks the bottom end",
  "would prefer if the vocals were a bit more prominent than the other instruments",
  "Sounds bright and punchy",
  "Distorted guitar too prominent. It aches for me.",
  "Bass is very low.",
  "too much panning to L channel, loud guitar",
  "Now choir too low compared to lead voice. In the 2nd part, however, when the two voices are mixed, the result is harsh and unpleasing.",
  "drum’s sound too loud",
  "the mix lacks hierarchy and is unclear.",
  "vocal a bit too loud",
  "Voice is thin - no bass - very dark",
  "voc too hot at the top, better in chorus. snare pulling to the left?? also too dark snare too compressed (guitars esp).",
  "LD V answers too loud, need perspective",
  "Too verby...",
  "Where is the snare? Can't hear it at all. Voice distorting and I doesn't sound intentional. Horrible balances.",
  "Dull. Smaller sound",
  "A bit too quiet. The backing vocals are too loud (very close to the main vocals).",
  "like the proximity of the vocals",
  "Sounds a bit thin. and narrow with regards to panning",
  "Bass is too low",
  "drums loud in comparison to rest of mix",
  "the voice is not prominent.",
  "Sometimes, it depends on which sort of mix effect is wanted. In this track,",
  "too much compression and strange backing vocals",
  "A bit too much with the back vocals. Balance not quite there.",
  "very creative, but unconvincing LD V answers too loud and out of phase",
  "Vocals a little exposed. Backing vox out of phase?",
  "too much organ. Nothing has definition. Harsh mix. Too much compression.",
  "Vocal too quiet. Are backing vocals out of phase? Phase issues?",
  "Hey where is the band? Before the overdriven part this is just vocals",
  "Seems a lack of range in frequency content",
  "weak leading voice, guitar very evanescent. Too much bass. Good spread.",
  "Vocals are disappearing in chorus, but too loud in verse. out of balance.",
  "Lots of masking going on.",
  "a bit muddy",
  "drum’s sound",
  "the voice is not prominent and unclear in reverberation.",
  "Backing vocals scare the shit out of you, general balance is mediocre (sorry)",
  "a little bit weird on background vocal",
  "bg vox too loud and phasey. drums over compressed and tiny.",
  "out of phase backing vocals???? too compressed",
  "Inappropriate back vocals. Overall mix does not work, not really creative. (mixed by a Robot??)",
  "Background vox jumps out in a very disconcerting way, can hear fade in and out of track - much compression",
  "backgrounds wierd - phasey, too loud. drums good guitars too loud dwarfing drums in chorus",
  "the is the Robot mix; completely fucked up LD V and LD V answers (maybe they being out-of-phase fooled the machine) EBass surges forward unnaturally in one spot BG vocals",
  "What is happen with the back vocal? Worst effect I've ever heard. Buss compression is out of control. This mix is so bad is actually makes me angry.",
  "Very phasey. Thin. Cheaper sound.",
  "Too much midrange, cannot hear the low frequencies.",
  "everything is too forward, especially, the background vocals.",
  "backing vocals coming out unbalanced",
  "backing vocals very dominant, a bit flat compared to others. Filtered?",
  "Weird backing vocal reverb thing going on... - odd compression things?",
  "I don't like the backing vocals. Weird panning.",
  "loud backing vocals, strange EQ in vocals and general",
  "Choir too loud, it sounds like on/off, no transitions, too abrupt.",
  "instrument sound too loud in the middle",
  "the deputy is too strong.",
  "Drums too loud. The clean guitar has turned to slightly overdriven here.",
  "Accompaniment sound is too loud",
  "less snaps; more space on the vocal",
  "Stereo width is wide. Vocal is disattached from the rest of the mix.",
  "Vocals very close, very dry. Need a bit of a sense of space around them. They are also too loud. Stick out.",
  "Super Dry",
  "No blend of instruments at all",
  "voc too low",
  "too dry; clicks panned too far left, not enough ambience; bad comp on e piano",
  "male vox way up front (uncomfortably)",
  "Spectral balance is bad, EQ is not bad",
  "vocals sound wierd and super dry. reverb problem?",
  "sounds one dimensional",
  "Finger clicks sound unnatural, heavily panned. The accordion is lacking the high frequencies",
  "Too trebly, not enough depth",
  "instruments sound more separated than mixed",
  "Vocals are completely unprocessed and dry, along with the finger clicks which completely ruins the second half. The dry-ness works a bit in the beginning but just feels unfinished.",
  "Sounds dry compared to other mixes.",
  "Vocals a bit flat and dry sounding",
  "vocals dry, rhodes too present",
  "Lead voice is too loud. Now it happens the contrary to many of the previous tracks: there is a lot of panning in order to achieve separation between instruments, but the result is poor and chaotic.",
  "instruments‘ sound too loud and vocal’s sound. Not enough fusion.",
  "the voice lacks sense of space.",
  "Track 4 is not interesting. It sounds like the singer have experienced many vicissitudes of life, and timbre is kind of weak. So stronger instruments sound is needed to support the singers voice, especially multiple instruments are played. If it is a personal concert only with one Folk Guitar, this kind of show way can be concerned.",
  "less snaps and accordion",
  "Drums way too set back. weird reverb. Vocals / snaps way too forward comparatively. NO KICK DRUM?",
  "vocal stands out in the mix and instruments are far behind the vocal in the mix",
  "Too much reverb: distracting; Good level and placement on vocal, though too harsh; Lack of stereo width; ensemble (minus vocal) competes for same space; phasey and swimmy; no low end",
  "Reverb on the vocals is distracting. Takes away from the vocal sound. Vocals have a high-mid peak that is unpleasant to listen to. Needs a much fuller bass - can carely hear the bass. Also a lot too much reverb on intruments. Need a lot more of the direct sound from the band. Feels like they are at the back of a big hall.",
  "Most reverb on the vocals thus far, but I like it. Drums too roomy though, and buried. Can't hear the keys at all.",
  "vocal is double? phasing issues; Vocals too loud",
  "no bass or kick. not sure about the reverb on the accordeon.",
  "too much compression",
  "are you fucking kidding me? weird balances; bad rev",
  "lots of verb; poppy mix",
  "pretty bad mix... vocals too loud, drums too far.",
  "vocals are way to loud and out of balance with the song/ EQ feels really wrong. balance between back and front items isn't working. No dynamic in song.",
  "lyrics lack depth",
  "Instruments not present enough",
  "A bit sparse",
  "\"metallic\", second voice too loud",
  "bass too low (non existent!)",
  "What happened? Clear artefacts from compression, vocals and finger clicks way too loud and in the face, music is not existing and also it lacks the bottom end.",
  "Very thin, vocals too prominent",
  "unbalanced",
  "Mix sounds cold and messy.",
  "much of the spectrum missing",
  "Weird EQ on the vocals maybe. Guitar doesn't really shine through.",
  "too much reverb on everythin, thin vocals, everything thin",
  "To sharp and centered, it is harsh in general. Some instruments cannot be heard. A lot of high/mids content.",
  "vocal‘s sound too loud",
  "Poor mix, low presence of overheads in the drum mix, vocals in the foreground a bit exaggerated in some parts (lack of volume automation), lack of punch in the rhythm guitar.",
  "No bass; vocals with an excess of mids.",
  "Voice very distant from the mix. Drums lack definition.",
  "Too much finger snaps. The automation seems really wrong on the vocals. The drums are thin and not present. too much reverb on vocals. Back vocals are too present. Lack of good balance between instruments.",
  "Finger snaps too reverberated. The absence of bass makes the music too light. Guitar very reverberated.",
  "Voice without any audio processing, only with some reverb. Doesn't seem to have any EQ.",
  "The voice is much louder than all the instruments, and the mid-low and low frequencies are very low. Moreover, the reverb used gives an exaggerated sense of an artificial space.",
  "Needs more body. Voice too high, processing.",
  "The initial melodic instrument is too prominent. The voice is too strong, but relatively well balanced with the choir. The reverb on the claps is on the right path, just too much attack.",
  "- Vocals too high - Drums too low - Bass too low - Good Guitars mix - Strings are too high and on the right",
  "Vocals might need a little more presence",
  "wacky reverbs, way too much bass; accordian too low; drums obscure",
  "The back up is bit loud in this one too.",
  "quiet vocal",
  "Slightly masked/low lead vox, b. vox panning off to one side",
  "the most detailed",
  "vox a bit low",
  "Vocals are a little thin and quiet and the mix is bassy",
  "vocals really thin and far away, rest is boxy and dry",
  "Too much bass. Too much bass. You cannot differentiate instruments in the second part.",
  "instruments‘ sound too loud",
  "the space in the music is too large and the reverberation is too obvious.",
  "Bass with excessive sub; voice with too much mid-range equalization; the piano is not noticeable, guitars are also not very present.",
  "Bass becomes too prominent at times. Main vocals too distant.",
  "more organ; background vocal and guitar isn't as important as lead; less snaps",
  "Muddy bass. Very bright guitars, strumming is very apparent. Vocals uneven. phasing, evident especially in cymbals.",
  "the mix sounds flat overall. Instruments don't blend well with each (guitar and drums)",
  "lack of definition in most instruments - washed out, muddy; too much low mids in vox; reasonable thump on kick; both vox need more compression; keys are basically missing",
  "BG Vocals too loud - they act as a second lead, but are only singing part of the line, so it doesn't work. Some elements of mix (snare, etc.?) have a bit of a mid peak that sticks out.",
  "Too much comp. on bass; Vocals too wet that loose presence",
  "backs too loud, need more air. phasing?",
  "strange verb on snaps, and vocal",
  "bg vocals, acou guit too loud; drums sound like toys; too much buss comp; voc needs better/more comp",
  "strange vocals; narrow & dark; mono???",
  "back up too loud in the beginning. some sort of weird pumping within vocals. Not as dynamic.",
  "cardboard box drums?",
  "Sounds flat, bad spectral balance",
  "The back vocal doesnt sound like back vocal, they pretty much at the same level os the main vocal.",
  "8th: Vocal is strangely coming in and out.? Everything is perceivable but trampling each other. Feels like no thought was given to the mix - \"faders up and I'm going home\" sort of stuff. Ugly overall tone, and summing resonances all over the place.",
  "Percussion too low, too much guitar/ low end",
  "lead too far",
  "snare sound weird",
  "too much emphasis on the low/midrange and on the guitar.",
  "not much ambience",
  "Some phasing issues on some tracks which is distracting. Otherwise very similar to track 6.",
  "Mix sounds a bit flat.",
  "can hear reverb, lively also because of the backing vocals but unbalanced, too resounding of specific frequencies",
  "I can't really hear the bass.",
  "boxy but very panned",
  "Choirs too loud compared to lead voice, rhythm guitar too. Why I don't hear some of the instruments that I can hear in the others? Decompensated mix.",
  "Harmony too prominent",
  "the hierarchy is unclear.",
  "muffled bass, overall image is slightly narrow",
  "Vox too quiet. drums sound swag but are too loud; good amount of bass freqencies (bgtr & kik); reasonable person's panning of the 2&4 gtr ++; sounds like a record. too much sub bass.",
  "Drums a bit too loud. Kick and toms feel way up front, with cymbals way back.",
  "Too much comp on drums",
  "not too bright; lots of punch",
  "too much of drums",
  "Clicks a bit high, vox a bit isolated",
  "Vocals too quiet",
  "vocals not so prominent on the vocal parts",
  "Drums a little loud on mix.",
  "weak, distant, better in the first part but a bit too much low freq (not when he says waiting)",
  "Accompaniment sound is very heavy.",
  "the timbre is not good enough.",
  "drums seem small. big vocals",
  "vocal, drums dominates the mix too much. Panning is wide but lack of details and clarity.",
  "vox are overly harsh (too much 2-8k) and have too much reverb; good level and presence on drums; Why is everyone panning the one gtr that hits on 2&4 hard left???? there are too many lows and it really throws off the stereo image and is distracting, and also i don't like itwhere is the kick drum?",
  "not sure about the reverb on main vox. vox loud.",
  "nasal vocal",
  "lead voc rev too crisp; bg voc needs better/more comp; piano/accordian mix little light",
  "bright vox; somewhat hollow",
  "The beginning back up vocal is also too loud. Vocal seems very seperate from the rest of the ensemble.",
  "Mix is ok, poor EQ",
  "lyrics are too seperated from the instruments.",
  "second voice not loud enough",
  "Muffled, vocals too loud",
  "Very thin",
  "Can hear reverb. Little too much high EQ",
  "Too much reverb on the vocal.",
  "too much reverb on drums, all sounds",
  "At times, the vocals stand out from the mix, becoming more prominent and deviating from the space created for the drums with reverb.",
  "Muddy comparatively, lacking clarity, lots of low mids. vocals uneven",
  "dynamics are not controlled well in the vocal. Overall sound is slightly dark. Lack of dimension",
  "Too much dynamic range in vox leads to loss of words; no excitement in any instruments; very flat and unexciting; reasonable balance within ensemble; midrange-y; no highs, no lows (... must be Bose)",
  "Vocals",
  "Vocals too loud; No bass",
  "voc too dry, overall mix too narrow",
  "drums too dark; lead voc needs more comp or better rides; clicks too far back for the ambience",
  "smiley face mix (inverse bose)",
  "dry",
  "7th: I don't enjoy the approach. Vocal goes up and down (someone forgot compression or riding), the balance is aggressive. I also don't enjoy the reverb on the vocals.",
  "Weaker lead vox, some masking in instruments caused by percussion",
  "muffled",
  "Confused, lacks detail",
  "feels a bit constricted",
  "vocals too dry",
  "Very dull and lifeless in the second half. Starts off OK, but drums completely dry and unprocessed. Feels like a balance mix.",
  "Bassy",
  "Vocals a little loud.",
  "Very busy mix. Not enough EQ'ing going on.",
  "narrow muddy dense and dry",
  "Lead voice is too low compared to the rest of the instruments. And then some instruments too loud. Mix is decompensated.",
  "Vocal's sound not prominent.",
  "there is no hierarchy in this music and the voice is too soft and less prominent.",
  "punchy kick. Dark. lots of space. muddy.",
  "muffled kick drum, vocal is too soft",
  "waaaaaay too dark; no definition in drums - just nondescript thumps; everything is washed out; GTR panned hard left is distracting",
  "Kick feels over-compressed and too small. Mix needs more room to breath. Not a fan of vocal verb.",
  "Too much comp. on bass. The mix is pumping",
  "kick sounds boxy, no impact with snare. inconsistent bass",
  "dont like accordian in middle, voc too dark",
  "drums washed out & out of perspective with vocal and guits; too much a guit; bg vocal too loud; clicks way too low",
  "Vocal could be louder. doesn't jell as well.",
  "too quiet snare, loud kick",
  "Spectral balance is bad to extreme. EQ is flat",
  "6th: confusing, stuff is piling up all over the place and instruments trample each other. The electric piano is too loud for the dulness of the sound. The second half is pretty. After the example A it sounds dull, but everything would. Too much compression on the drums, and everything pumps. I understand panning was done for clarity, but I object to the perspective that was created, it does not flatter the syncopation between guitars and keys.",
  "Drums a bit low",
  "instruments too loud",
  "bit muffled",
  "Lacking some punch",
  "some instruments too loud than others",
  "Mix is a little busy, lacks space.",
  "Vocals a bit too quiet",
  "lows really muddy, bass not audible",
  "The eq is not quite right, maybe lots of mids. There are dynamic jumps too. Not too bad in the end. Some instruments sound 'muddy'",
  "bass sound too loud",
  "the voice is less prominent and lacks sense of space.",
  "Excessive reverb on the snare and excess compression and bass on the kick. Lack of reverb on the accordion and excessive presence of pianos and guitar with 'drive.' Missing automation for added gain on the main vocal in the chorus. Lack of more expansive reverb on vocals and backing vocals.",
  "Snare high and with too many mids, high toms unbalanced relative to the panning.",
  "Electric piano very prominent, and acoustic guitar on the left side unbalances the mix.",
  "Too boxy. The vocal seems a bit thin. Everything else is competing for space.",
  "Very muffled, low range very prominent.",
  "Electric guitar loses some brightness. Vocals also lack prominence and brightness.",
  "The reverb on the vocals initially sounds bizarre, although it grows on you. The female choir accompanied the soloist very well. The big problem is the beginning with the instrumental too prominent.",
  "Bass not prominent enough, snare too high.",
  "The female vocals create some discomfort.",
  "Voice with too many mids that make it muffled. Secondary voice with a reverb that doesn't fit. The main voice needed more attention to volumes.",
  "The vocals and the choruses are too loud compared to the entire mix. The overall tone of the mix has an exaggerated presence of a sharp midrange that makes it difficult to listen to. The use of reverbs distances the snare and the vocals too much because they take away definition and cutting.",
  "Missing a bit of body.",
  "The initial melodic instrument is too prominent. The creative reverberation doesn't fit.",
  "Excessive presence in the bass lines. Almost total concealment of pianos and accordions at the beginning of the track, and then a sudden increase causing strangeness. Lack of panning in the acoustic guitars. Lack of presence of the main voice in the pre-chorus part, errors in the cuts and fade outs of the overheads in the chorus, little presence of the female voice throughout the song.",
  "The accordion, too dynamic, steals the spotlight from the voice.",
  "Too much low end on drums and on the bass. Everything is competing on this one as well...",
  "The voice is louder than all instruments, and the entire mix is too midrange and bass-heavy, lacking brightness and definition. In addition, the stereo image was underutilized, making the mix too monophonic.",
  "Main vocals overly dry and prominent, lacking treatment in the vocals (gain automation and application of room/reverb and delay). Mix with an excess of mids and bass, making the music dull. Lack of presence of backing vocals. Almost total concealment of pianos.",
  "Acoustic guitars with excessive mids; high toms; vocals not prominent enough.",
  "Kick too prominent. Acoustic guitar could be a bit more subtle.",
  "Drums with little definition, sound too muffled. Vocals could have more air.",
  "Voice very dry, without any effect. In fact, the entire instrumental seems very raw, with little audio processing.",
  "In this mix, there is a predominant strict high midrange that is slightly elevated. Adding to that, an exaggerated midrange makes the mix muddled and lacking definition.",
  "Not a fan of the snare sound. Probably too tight of a gate.",
  "Excess in the bass and vocals, lack of gain in the rhythmic guitar lines, and excess of toms, kick, and snare. Failure in the cymbal lines from the overheads, creating a reverse effect and a too much sense of a 'cut-off' and mixing error, especially in parts without percussion. Poor mix.",
  "Overheads a bit high; vocals with excessive reverb. Backing vocals could be more separated from the main vocals.",
  "Too much reverb on vocals. Back vocals are not well placed. the drums should be a bit brighter. The bass is to high in the mix. Lack of definition all round.",
  "Voices with too much reverb, especially the secondary. Acoustic guitar could be more present. The entrances and exits of the cymbals are heard in the vocal track in the second part of the song. Some bass frequencies become too prominent.",
  "The snare is slightly high compared to the other instruments. Tonally, the entire song has a very prominent midrange, especially in the vocals. The use of reverbs and delay, despite opening the stereo image, adds a midrange timbre that muddies and confuses the mix.",
  "The mix is quite unorthodox: I don't understand the cymbals (distorted?) in the drums. The beginning sounds terrible! Although the soloist's voice and the choir are elegant (but not well balanced between them).",
  "- Vocals too high and too much reverb on them - Great Strings and Guitar mixes - Drums could be higher - Too much Bass",
  "Excessive reverb and gain that pushes the vocals 'out of the music,' balanced bass lines, good presence of backing vocals, lack of presence of accordions and pianos, excessive presence of the drums in general (especially toms, snare, and kick), lack of overhead presence in parts with fewer elements.",
  "Voice not prominent enough and with excessive reverb; mix unbalanced relative to piano, accordion, and guitars.",
  "Drums a bit high compared to the rest. Especially the snare.",
  "Bass a bit loud. Not a huge fan of the verb.",
  "Bad EQ on Bass, OK balance. Lacks of power.",
  "bass boomy - lacks definition",
  "bad rides on vocal. verb on Lead Voc out of perspective. weird drum perspective (too low). bass too loud",
  "The drums don't sound panned at all. Also, the vocals sit too far back in the mix. Background vocals are panned wide, which is peferred.",
  "vocal could be a little brighter",
  "too much bass",
  "A little too much lows on the bass, too boomy. Drums sound OK. Vocals too loud overall.",
  "too much bass and not enough presence in the vocal",
  "reverb too much/wrong. vocal spread is neat, but evertyhing sounds separated",
  "Too much low end. Clouding what could otherwise be an OK mix.",
  "muffled - too bassy",
  "Believe this may be over compressed. Not feeling a full dynamic range is present.",
  "A little bit too much reverb on vocals. Just a tad.",
  "really muddy and veiled",
  "music rhythm quite weak",
  "sound in the left side is strengthened",
  "You destroyed the drums with that compressor (shame on you). Slapback on the organ ain't nice. Oh lord that compression, please dial it down, let them drums breathe. Kick is too cardboardy. Organ gets too loud it takes the attention out of the vocals.",
  "thin mix with too much verb. and the guitar verb freaks me out.",
  "Very bright, the balance on the drum kit isn't right.",
  "Too wet!! Need more snare.",
  "no low end, too bright, too much reverb",
  "Super bright, no power, no lows.",
  "lots of 1K in voc. R voc double too loud org too loud in places, needs rides. guitar is thin",
  "not enough snare. verb on elec piano out of place.",
  "drums sound thin",
  "I feel that the vocals are too seperated from everything else. I think it needs to be turned up a little more.",
  "the verb decay is a little distracting but otherwise it sits evrything comes through well",
  "unclear",
  "harsh and thin with too much reverb trail",
  "These verbs are really odd, and then why is the voice so dry in comparison. Drums sound really anemic - too much super high end and not enough punch.",
  "Low end is too weak in kick drum and bass guitar. Reverb on electric piano is not to my taste. For this music I prefer a dry tight sound. Guitars don't cut through the mix like they could, too dark.",
  "snare too low",
  "Too bright and thin hi hat",
  "vocals too much to the front",
  "Drums less punchy, vocals at the front.",
  "Tad too much reverb",
  "singer voice too loud,rhythm quite weak",
  "Keys too loud and vocals compared to the rest of the instrumental.",
  "The vocals are too high, and the entire mix lacks body and brightness. However, the subtle reverbs give it more dynamics.",
  "- Abusive reverb in the vocals - Drums could be higher (particularly the snare)",
  "Groovy but dry, bass is too loud. Whatever chorus effect you did with the guitar doesn't feel right. Elements are jumping out all the time and it makes it hard to concentrate on any.",
  "vocal needs to be more louder",
  "The bass is too loud.",
  "Low mid pile up. Cool effect on the pimp lyric.",
  "Weird balance, Dry. Punchy but Muddy",
  "dark thick esp. bass, but voc is bright?? big wide org",
  "weird diffuse effect on lead, gtr. also, this cut is louder than others (esp 2, 4, )",
  "too much kick and bass",
  "bass is a little overpowering",
  "too much bass, but I could dance",
  "too much attack on the kick and bass",
  "TOO MUCH LOW END.",
  "Exaggerated low end, especially in bass guitar. Kick drum gets masked, other elements are as present as they could be. The vocal is too recessed as well.",
  "Really tight and punchy, but lacking space",
  "too much base",
  "Strange balance.",
  "Vocals are a bit dry. Bass too loud",
  "too much low mids, less highs, dry but punchy, vocals too dry",
  "rhythm quite heavy",
  "Sounds not bad but a bit tiring.",
  "drum and some sound seem to increased in right side.the pitch is roughly the same as vocal",
  "Kick and bass a bit muddy, Hammond with excessive volume.",
  "Exaggerated bass on the bass guitar.",
  "Voice needed a little more shine. Low too present. Keyboard in the second part of the music very loud.",
  "background vocal it's a little bit loud and dry",
  "too loud backing vocals",
  "Bg vocals are too loud/ not tucked in the same space as main, organ too soft",
  "extra LD voices (delay). BG too loud. too much verb on kbd",
  "the placement of the instruments in the stereo field makes sense, except for the vocals. I think they could have panned the background vocals wide because it is covering up the lead vocal too much.",
  "drums are a little dark, vox could have some more presence",
  "hate that out of phase crap.",
  "Drums don't sound full. In fact everything sounds small. Back vocals way too loud, they are louder than the lead...",
  "Balance between instrument is off and too dry. even the balance between the main vocal and back up vocal was not blanced",
  "weak energy and flat. needs better vocal control. way too much \"fun stuff\" going on with the vocals. They should be leveled and balanced first!",
  "The BG vox are a bit out of control. Snare is not super great. Vocal levels are really inconsistent.",
  "Vocal has too much taken out of it around 250Hz, and there's something weird going on in the stereo image. backing vocals are too present.",
  "backing vox way too loud",
  "Backing vocals are too loud.",
  "A little thin",
  "Very similar to track 3 but a little too dull. The backing vocals are far FAR too loud.",
  "Backing vocals too loud. Bass too loud, too, but maybe it's the room.",
  "Organs too quiet.",
  "panning awkward, backing vocals way too loud, main vocals disappear, rhythm flat and muddy",
  "singer voice lack of balance ,accompany singing too loud",
  "Chorus sounds a little weird.",
  "the vocal sound like in the left and right side and create a stereo effect.the harmony is louder compared to the former,",
  "Too narrow, not much happening. When the chorus hits I hear a better balance but some weird resonances make it feel messy.",
  "drums aren't right yet",
  "a bit dark, bass too muddy",
  "Lacks a bit of overall power. Keys should be louder.",
  "this mix is noticably louder then the others. drums dull. pans weird.",
  "muddy and low mid",
  "Main vocals are back too far in the mix. Drums are panned up the middle again, it's not a great sound.",
  "mono",
  "vocal is too dry. snare level",
  "Drums sound too narrow. The mix as a whole is too narrow, causing masking. There's something weird happening around 2kHz..",
  "Strange eq on drums",
  "Lacking punch",
  "Too much low end",
  "Vocals a little flat.",
  "Boxy.",
  "need change",
  "Too much reverb, vocals too loud, too much reverb. My god turn down that reverb. Frequency balance is alright but that reverb! Did I mention that it's probably too much reverb?",
  "too much reverb",
  "vocal verb aint right",
  "i don't like reverb on vocal",
  "Inappropriate Reverb on vocal. No real low end.",
  "weird small room on vox, bass and kik fight, vocals sound like from phone",
  "bathroom verb on voc - bad. snare is too far back in the mix",
  "ridiculous verb, especially on LD voice. bad mix esp on snare, kbd and gtr (both too low)",
  "too much verb on vocal",
  "The reverb on the vocal doesn't fit the rest of the instruments. It makes it sit back, you can hear the room they are in too much. The drums also don't seem panned approperiately.",
  "not a fan of the vocal sound",
  "bass lumpy",
  "Vocal sound sucks. Vocal verb is crappy and too hot. Drums are lifeless, need EQ and proper compression. Your mix actually gets quieter when it should get bigger?!?! Levels OK overall.",
  "too much reverb for this genre of music.",
  "Why is the singer in the MMR bathroom?",
  "vocal too wet",
  "I don't like the vocal reverb, call too much attention to itself. Balance isn't bad, but the vocal ruins it for me.",
  "What? Reverb all on the right? Way too much strange plate hall. Solo rhodes lick on the left is way too soft. Vocals are way to far. I prefer the bg vocals panned closer together near the lead vocal. The reverb is really distracting me.",
  "Vocals are too prominent. Bad eq on the drums",
  "too much reverb on vocals",
  "as if in a room",
  "Reverb time is far too short, singer in the bathroom and not in the same space as the rest of the mix so doesn't bed in at all. Drums are quite bright and fatiguing to listen too.",
  "Drums cut through. Too much reverb on vocals",
  "Too much reverb, mix loses impact.",
  "What the heck is going on with vocals. Sounds horrible.",
  "horrible reverb on vocals, they all sound like they're in the bathroom, muddy drums",
  "Not good.The release sound is too sharp, I means that I feel like I'm hearing the sound in the space.",
  "rought",
  "Main vocal reverb is really obvious, distractingly so. Bottom end is obvious but a little 'untamed'.",
  "EQ has some problems. Sounds not very comfortable.",
  "bad.... the problem is that it is a little far when hearing the sound ,and it is like the singer is far from the audience and sing in a big hall",
  "Inconsistent vocals with too much reverb and lacking gain and compression. Lack of presence and work on the guitars. Excessive pianos in the chorus for mix balance.",
  "Poor mix, vocals with excessive reverb, excessive reverb and too loud also in the choir vocals.",
  "Voice very hidden by reverb.",
  "Too much reverb on the vocals.",
  "Weird voice. With a lot of reverb, or better, more than is present in genre music.",
  "The mix is not very bright, and the use of \"slap\" was exaggerated, making the vocals detached from the entire instrumental.",
  "Excessive reverb on the vocals.",
  "Loud snare! An the eq on it is funny. Bass is too loud. The reverb on the background vocals is too long and too much.",
  "too much reverb",
  "vox thick and they get lost in all that verb.",
  "Needs more kick. Verb needs tweaking.",
  "Too dark, too wet. Not a bad balance between instruments though.",
  "too much reverb and too dark",
  "little too much verb, kick has no punch, vox sits too far back",
  "too washed out with reverb. snare is boxey",
  "horrible drum sound. long verb on snare???",
  "muddy mix",
  "There is too much reverb on the vocals and quiet, and the whole mix in general could be a little louder. Also, the kick doesn't communicate well with the bass, so you don't really get a dance feeling.",
  "Drums EQ bad, needs to be brighter and more lows. Vocal verb is way too much, way too long, just makes mud. More drum level. Vocal needs leveling. Wrecks the music.",
  "too much drum. dosen't sit well with the vocal",
  "messy all over. muddy, too much reverb, reverb needs to be EQ'ed to reduces low and high resonances that are annoying to listen to. Vocal balance is too loose. No real punch to anything.",
  "There is a lot wrong here.",
  "I don't like your snare, the drums are a little muffled.",
  "a bit muddy",
  "Too dark, drums sound dull and dead, vocal is muddy, there's a really long reverb tail going on, possibly on drums.. way too long, makes everything unclear and out of balance.",
  "Dark, muffled a little overall. Room reverb is weird. Organ and keys stuff is too dry, relative to wet drums and voice.",
  "ok, vox a bit low and dont like the mix verb",
  "Vocals are too loud and reverbered. Muffled eq",
  "Too bassy",
  "not so balanced",
  "Very dull and flat. Vocals sit on top. Could be a backing track and singer. Vocals too quiet as well.",
  "Vocals sound thin. High hat sound poor",
  "Too much reverb on the snare.",
  "really muddy and veiled, like 2 but strange space",
  "Sound does not have room(?), I mean that sounds seems to be compressed after mix",
  "Reverb is too obvious, on the snare particularly. Mix sounds quite lo-fi, almost like it's been mixed down to an unclean tape machine at low IPS. Could use some (more substantial) bus compression to bring everything together.",
  "the sound seems lower especially the musical instrument seems to be kept down",
  "a bit weak low end, too bright vocals",
  "Kick is a bit much, organ is to soft, balance needs to be refined. A bit dry",
  "gtr thin. BG light.",
  "Whole mix sounds too light in the low end. The instruments aren't glued to each other. The individual instruments don't sound connected together for the whole song.",
  "ok, whimpy bass",
  "too much to the left and too much high",
  "hats too high. too fizzy. also bit dry",
  "Drums are too prominent.",
  "Too trebly",
  "Drums cut through",
  "Too aggressive. I don't think it's incorrect, but I don't like the style, it hurts my ears.",
  "Too airy.",
  "lose lower frequency,narrow",
  "like float on the surface,",
  "louder ,particularly the drum and small cymbals. the vocal sound like in the middle",
  "Excessive kick, choirs could be more separated in the panorama.",
  "The kick is a bit too loud. In some moments, the vocals escape from the mix.",
  "In this mix, the snare is a bit too midrange-heavy, and the bass is slightly exaggerated.",
  "Too much bass.",
  "Lack of kick presence in the track. Excessive reverb on the main vocals and lack of gain on it. Lack of well-elaborated EQ and compression on the bass, which for certain frequencies becomes very evident. Good balance between guitars and pianos.",
  "Snare completely clashes, instrument distribution in the mix poorly done (piano and guitar are 'fighting' for the same space).",
  "The vocals are a bit distant. And the reverb on the snare is too prominent.",
  "too much reverb! Lack of definition all round.",
  "Voice very distant. Snare is in the place of the voice. Bass too loud.",
  "I didn't like the snare of the drum, and the vocals also seemed quite distant. Perhaps because of the reverb. The entire instrumental seemed distant.",
  "The snare stands out compared to all instruments. The mix is quite midrange-heavy and with too much reverb.",
  "The vocals are not poorly treated, but the rest of the instruments seem more muffled, needing a better balance between volumes. Instruments also need more brightness.",
  "Bizarre equalization of the vocals when it becomes very low (at the beginning of the song).",
  "Missing some strength despite being balanced.",
  "Snare sounds too compressed. The drums lack some brightness. The vocal seems boxed. The rest of the elements are quite hidden.",
  "The vocals seem to be bleeding into the other microphones. It sounds almost like bleeding. Keyboards in the second part of the song could be lower.",
  "Little relationship between the vocals and the rest of the instrumental. The vocals should be slightly louder.",
  "The snare and the keyboard are a bit loud. Overall, the snare stands out for being too filtered and with a very pronounced midrange characteristic. The mix is almost monophonic, making it uninteresting and confusing.",
  "The drums could be more present. The snare has too much space.",
  "Lack of brightness in the low and high frequencies of the drums. Everything seems to be too focused on the midrange. This characteristic extends to other parts of the music, sounding like low-quality streaming. Despite this, it shows good internal balance between tracks, except for some vocals in the chorus that are excessively loud.",
  "Kick lacks presence, snare too midrange-heavy, bass lacks weight; vocals are too midrange-heavy, backing vocals are not prominent and poorly distributed in the mix.",
  "Everything is boxoed. Seems that the only thing that is panned is the guitar, and seems out of phase.",
  "Excessive dryness in the voice.",
  "Muffled music. Voice not fitting well with the rest of the instrumentation. Excessive presence of low frequencies.",
  "The voice is too loud, and the volumes between the various backing vocals are unbalanced. Overall, the entire mix lacks any brightness and definition. The mix is quite monophonic, making it less interesting and more predictable.",
  "The keyboards are too prominent.",
  "- Snare drum too dry - Vocals too high (compared to the rest)",
  "Move more faders. Backwards drums.",
  "more electric guitar and piano, lead vocal is too upfront, no support from the band, missing lead vocal double parts? could use more reverb on the vocals",
  "Feels a bit busy",
  "too much energy without control",
  "bad eq, lacks mids thus lacks some punch. drums sound dry, too far back. quite wide",
  "some as track 4",
  "Less fulness.",
  "Too much high end. Not enough reverb",
  "More low end. Verb gets out of control when more instruments playing. Terrible.",
  "keyboard, guitars are too loud in the mix, drums sound far too back, backing vocals are too loud and too reverberant",
  "Verb too long. Sounds way overcompressed. Drums have no impact. BGV are in a cave -Sounds silly.",
  "Too much reverb on pretty much everything. Especially snare! Sounds like the snare is at the back of a church and is barely audible and all reverb. Swimmy and muddy. Guitar is way too quiet and drowning in reverb too. The vocal reverb is too long and/or too high in level. Also track is too compressed.",
  "Crushed drums, not loud enough....too much verb on everything. Same verb on everything?",
  "reverb does not match the mix",
  "too much reverb. drums sound thin. uneven vocal levels. unstable mix",
  "little too much reverb, bass comes and goes - sounds like too much buss compression... vocs too hot in chorus",
  "truly a terrible mix, nothing more to say than hope noone needs to listen to this again",
  "Thin. Vox sound like they're in a different room/space and are WAY closer than the band.",
  "Worst mix by far. Verb is completely wrong and way too much, this isn't classical..... Drums are tiny and sound horrible. Voice harsh. Dull overall mix. Backup vocals way too loud. And wierd drum compression. This is awful.",
  "too much verb",
  "Not good. Too much long reverb. Thin. Drums too quiet.",
  "Oh God, has this been mixed a church? Did you drop the mix in the reverb tank?",
  "Too quiet, needs a buss compressor (or a better one) to help keep the energy up when the vocals are out. During chorus everything is lost in the vocals reverbs!",
  "Too much importance for the voice.",
  "Way too much reverb!",
  "sending all the tracks in an excessive amount of reverb does not make a good mix.",
  "Feels quite cold. Drums lack impact.",
  "no...I feel confused by the atmosphere of the voice",
  "Too much presence in the vocals",
  "too thin, and muddy, vocals extremely present, chorus",
  "sound a little distant than other tracks before 6",
  "Too much reverberation.",
  "Too much reverb on back vocals, or too bright?",
  "Too much reverb and drums are too low in mix. Vocals too high in mix.",
  "The dryness is sort of cool. HH too loud - it pulls much of the focus in the mix. Vocals are too low. Keys are too low as is organ. Kick needs more body.",
  "very dry, don't like the reverb on drums, too much low end on snare. Other than that good balance. not a fan of the dry response vocals in verse.",
  "hats a bit high",
  "Abusive eq and compression of the drums. The balance between the close mics and over-head kills the life of the drums (OH are to low compared to close mics). HH eq is very harsh. Vocal lack some air and brightness on top of not being loud enough.",
  "too boxy, dry, weird eq, especially drums unbearable",
  "Drum is dull.",
  "Too much confusion for jazz. Confusion, or I rather say too much dirt. Back vocals are disturbing.",
  "Too much high-hat. Like having additional drums otherwise. Relatively loud and strangely placed around the head - something weirdly unnatural about the way the sound is in space.",
  "Pretty dry...",
  "Lots of presence on the bass, too much? Dry in general. Not bad except for the bass level.",
  "very dry mix, keyboard too buried in the mix, drums is a bit loud in the mix, overall could use more reverb to improve the blend",
  "Lead Vox too quiet. Balance of kit is off - too much cymbals, not enough body. Too much virb on the BGV.",
  "A little quiet",
  "bit dry on vox",
  "Bad snare, which you would not expect as the rest is ok.",
  "Like the drier vocals, but snare again too dry leaving horrible gaps between lyrics. Bass problem as well, too much there and not defined. Bass guitar likely culprit.",
  "Voice too important comparing to the groove of the music.",
  "mix fairly tight but too muddy. I miss the air and freshness of an open top-end",
  "Lacks punch, vocals a little flat.",
  "voice cut",
  "Less fulness.",
  "Background vocals don't need to be quite as loud, need to be balanced better left to right, need more verb.",
  "could use more space/envelopment with the drums. the snre pops too much?",
  "snare sounds too high and hollow, don't hear piano and electric guitar that well, backing vocals heavy on the left side, lead vocal could be louder during chorus, could use more organ",
  "overall too dry and narrow-left heavy",
  "Bone-dry.",
  "lacking bass",
  "Very narrow sounding. Panning?",
  "I don't like the hi-hat, lacking the highs and any sort of space.",
  "The tonal balance is not ideal. Too much low mid, therefore the mix lacks some clarity. Bass is masking the keys. Vocals (including BVs) don't stand out out.",
  "Too much bass.",
  "more dry, present, like 5, but vocals widened with tiny delay",
  "more prominent vocals",
  "There was a distinctive back vocal in this track, sounds like I just discovered a back vocal lady that I didn't hear in the other tracks.",
  "Bring out licks in guitar, make it sound bigger. Vocal too distant.",
  "Sounds like a 'live' mix with too much reverb on the lead. it gets lots. drums and organ drown out lead",
  "reverb is too long on the lead vocal, piano is too low, drums are too loud but reverb is good. snare is dark, backing vocals should be louder",
  "Vocal reverb is too long and/or too loud and/or too bright. Metalic. It's distracting. The snare reverb is too high in the mix as well. The BG vocals are quite a bit too quiet - need a lot more presence. The lead vocal level needs to be automated better - stuff jumps out and gets lost. Vocals are harsh. Mix needs more clarity. I think this is the robot.",
  "Weird imaging, BG vocals too wide. Not a great verb on the vocals...BG Vocals chorus way too quiet, can't understand what he's saying. Sounds like he's in a sewer",
  "too much reverb, vocals feels in a different room",
  "Drums not bad; too much verb on LD V REALLY bad BG balances. answers in Verses often inaudiblethin, unimpressive EGtr's",
  "Very wet.",
  "Way too much verb, nasty sounding verb too. Overall EQ very harsh and boxy, no warmth or low end at all. Back vocals too quiet.",
  "hats, snare and vox dont gell well",
  "Dull. Too much reverb.",
  "BVs are too low. Drums too wet: they sound far behind: more dry sound would be great.",
  "Backing and lead vocals are too low.",
  "it seems a live recording.",
  "Too much reverb. Too loud",
  "too wet, ugly reverb on everything, especially drums, muddy, guitar out of place, vocals too present, live feel",
  "Less fulness.",
  "Drum might have been a bit more quiter. In general the track sounds a bit distorted, as if the sound is trapped in a small place/",
  "Like being able to hear dynamics in the voice clearly. Back vocals don't mesh as well with main vocals. Too loud?",
  "The reverb is way too long",
  "lead vocal level is unstable and most of the time it's too low, reverb is too long on drums, don't heard electric guitar and piano that well, could use more backing vocals. snare sounds too thick",
  "Extreme panning is distracting. Way too wide. Not enough virb on lead vox. Lead vox too recessed.",
  "Don't like the snare sound - too boxy. Dryness of the BG vocals compared to the lead vocals is weird.",
  "needs more reverb, snare left heavy that pulls the mix",
  "reverb on snare too long. very enveloping. bass is a bit thin.",
  "LD Voc needs much more compression Drums not too bad, but the rev's not good REALLY bad LD and BG balances too much organ, too little EGtr pad in Choruses",
  "Don't think snare verb is appropriate. Drums boxy still. Back vocals too quiet. Vocal needs riding or compression. Pretty bad...",
  "vox a bit low",
  "The bass is too loud and does not match well with the rest.",
  "Not balanced. Vocals are lost, some words are not heard. Backing synths/guitars are too strong. Drums are far too strong and are too dry given the reverb on everything else.",
  "You almost don't hear the drums.",
  "Tonal balance not ideal. Beyond the false impression of warmth, the mix is fairly bassy and therefore doesn't sound very open at all.",
  "bass is too loud, and taking too much space in the spectrum. Vocals are burried under layers of organ, guitars and drums and don't cut through",
  "Sounds a little flat.",
  "muddy, lots of resonance on everything, probably from long reverb, put quite punchy in verse",
  "The vocal has less low frequency.",
  "I think main vocal and back vocals are not that distant. At some points they sounded similar as if only one person was singing. In general it sounds a bit like distorted a bit distant. It doesn't sound alive.",
  "Bass-y. Vocals feel too distant. Instruments too far away from voice. Back vocals don't mesh well with vocals.",
  "VERB bright. perhaps a little too much",
  "can hear the lead vocal reverb tail very obviously...too long drums sound compressed, don't hear piano and electric guitar that well, too much reverb on backing vocals",
  "Too much reverb. This is a cave. Balance is reasonable though.",
  "reverb to long and too much, especially vocals. could have more low-end overall.",
  "too much voc reverb. kick bass too soft. guitar too soft in verse. bg vocs good",
  "wrong rev on Lead V; Lead V needs more compression. all vocals need to be ridden. BG's in Choruses not balancedEGtr, Piano and Organ not balanced in Choruses",
  "Vox a little too wet and thin...",
  "What is this verb? Totally wrong for the music. Panning kind of boring. Levels are decent. Needs de-essing.",
  "Reverb too long. Loses intimacy",
  "No bass.",
  "Lead vocals are a bit too far back, would benefit from being brought a bit more to the front. Too much reverb on lead vocals (too wet, and tail a bit too long). Tonal balance of lead vocals not great either: it lacks some top air to breathe and cut through the guitar.",
  "Abusive use of reverb on vocals.",
  "reverb, not bad.",
  "The background vocals are too obvious.",
  "The track does't sound clean. Vocals a bit disturbing at some points. Instruments covered by the vocal.",
  "Too much reverb - feels echoey and sharp.",
  "lead vocal volume can be louder, some words can't be heard as well, drums and gutiars could come out more during chorus",
  "Vocals too quiet. Rhythm guitar too loud. Too much verb on lead guitar - it sounds far away. I like the snare Balance of vocals gets better at the chorus.",
  "vocal a little out of the mix-upfront",
  "Not bad, but bland. Kick thin. Bass a little hot.",
  "Too bassy",
  "Guitar doubling not well done, gets a bit incoherent. Vocals present and clear. Drums could be stronger, especially going into the chorus. Some clicks at start of chorus.",
  "Punchy rhythm section, but vocals don't manage to cut through very well.",
  "Backing vocals not loud enough. Generally like how the guitars sound when mixed together probably due to eq and panning.",
  "Doesn't feel spacious, little messy.",
  "no character",
  "Too much bottom end, weak vocal. Full sound.",
  "A tad too much reverb on the guitars",
  "The guitar sounds too loud, and the vocals lack depth.",
  "the timbre is not very good.",
  "The drums sound are uncomfortable. The frequencies of this track could be adjusted.",
  "Kick has way too much click.",
  "punchy drums but sticks out too much, rhythm guitar sounds diffuse, lead vocal sounds a bit dark",
  "GTRs too verby and dark. Drums at a reasonable volume - slightly too quiet though. BGV's too verby.",
  "Drums are buried in the mix and seem to be a little narrow",
  "kick has too much midrange. voc is in the bathroom... too much small reverb. voc too hot, esp in chorus",
  "vocals out of perspective - too loud drums too light, Snare thin EGtrs not mixed. BG's also not mixed. not sure what has been mixed.one of the only mixes i can hear the tamborine",
  "Strange verb...",
  "guitars have no bite. Drums too compressed, sound small. Kick is horrible, no weight at all. Vocals too loud. Did you even try to ride the levels?",
  "Lead vocal sounds slightly out of context. Reverb wrong?",
  "drums are a bit too far back. They don't bring impact and dynamics to the track as they should",
  "Kick drum not cutting through. Lot of reverb on lead vocals, noticeable at quieter part.",
  "Drums have a little too much compression / too quiet.",
  "too energetic at high volume, Rock...",
  "Drums not loud enough. Vocals sound weird, reverb issue I'd say.",
  "Guitars could hit a little bit harder in the chorus.",
  "Lead vox too loud. drums not powerful. not bad though. too dry in general?",
  "GTRS too washed out. Where's the kick.",
  "Background vocals a little uneven L-R",
  "guitars are dark and wimpy. I like the snare. vocals feels disconnected from rest.",
  "lead vocal WAY out of pocket with trackguitar mix not great. drums not bad.",
  "Vocals too dominant",
  "It doesn't convince me",
  "Flat snare, phat bass. All the hi hat! 8k!!!!",
  "The bass is not enough.",
  "the timbre is not good",
  "Ordinary average.",
  "Why don't you like drums? Vocals are too close",
  "Drums don't pop. soft and dark mix",
  "lead vocal is small, guitars are buried too much in the mix, backing vocals too loud",
  "GTRs too dark. Drums have no impact. The tambo is louder than the GTRS and the drums??? why? BGV's too washed out.",
  "Bass is muddy. Kick needs more point. Would like snare to be brighter. Vocals are a little too recessed.",
  "No snare, vocal too hot",
  "drums need mur attack and punch, vocals ok just a little upfront",
  "a bit dry overall. certain things stick out because of that, tamborine for example. Guitars too dark. drums have no punch, a bit soft too. where is the snare?",
  "Guitars too big, masking everything else. Vocal too bare. De-ess please. Drums too quiet. Vocal too loud. Too mono. Back vocals way too loud.",
  "Feels muffled",
  "Energy just lacking. Vocals sound close when this should be stadium filling, needs reverb. Energy drops in the build up to the chorus! Drums are just lost completely.",
  "vocals are a bit too far back. Mix sounds to bassy.",
  "Vocals sound flatter",
  "Lacks impact.",
  "the bass steals attention",
  "Guitars a little low.",
  "guitar and vocals a bit loud, rest of instruments too quiet (specially on second part)",
  "Plain. The rhythm guitar is too present in part A. Choir in part C too loud.",
  "The vocals sound bland.",
  "the voice is too prominent.",
  "The layers are variable, but kind of not focused.",
  "Snare sounds like a stick click.... Kick too big. Voice harsh. You really like tambourine? Back vocals ok. Balances not great.",
  "Very upfront sound. Drums too loud? Vox too dry? Guitars too quiet.",
  "Not sure about the panning",
  "vocals too prominent, instruments panned to L channel",
  "Clean slide guitar panned too much to centre for my taste, overlaps with the main voice and it's imperceptible. Also, the choirs at the end are too loud and they seem to be more present on the right, the result is slightly annoying and masks the lead voice. A little plain on dynamics too?",
  "bass sound too loud",
  "it lacks sense of space.",
  "Vocal too miuch verb. Less rhythm guitars in verse, more lead guitar fills. More low end.",
  "If one decided to mix this like an arena rock song with lots of reverb, this is not how one should do it. IOW too much reverb. Needs more drums... lots more. This is how to not get laid.",
  "Washed out. Too much reverb. Muddy. Kick and snare need to be louder.",
  "vocals seem too big for the mix, reverb too dark and big",
  "drums light",
  "Holy reverb, Batman! Strange strange strange...",
  "Way too much verb overall. Drums too quiet and too small sounding. Vocal too loud. Need something in the highs other than the vocal.",
  "Cheap and nasty. Rough demo?",
  "Reverb swamping everything. Does not fit really with this song, the tail is just too long and it is too dense. Lighter and/or shorter reverb would solve this. Beyond this, the drums are too soft for this. Energy from the drums are completely lost.",
  "Too much revrb on vocals as well as on the guitars. Snare drum very weak.",
  "Too much reverb on the vocals to point of annoyance. All other instruments seem actually quite clear and well spaced but difficult to get beyond the vocal track, hence low preference score.",
  "Drums too quiet, lack punch.",
  "acid voice, too much for me at medium-high",
  "Reverby Vocals! No bottom end.",
  "Too much reverb. Bad mix",
  "too much reverb on vocals",
  "Too much reverb on the voice at the beginning. Rhythm guitar too loud compared to the slide guitar. Better choir dynamics and separation.",
  "guitar sound too loud",
  "the reverberation is too obvious.",
  "drums sound far back and too diffuse, left guitar jumps out too much than the right guitar, backing vocals get a bit loud than the lead vocal",
  "Not enough snare. Guitars way too roomy/verby. where is the vocal? it's hiding behind everything.",
  "Where'd the kick go??? Snare is also too small and quiet. Too much verb on lead guitar - it's washed out. In the chorus, the BG vocals are too loud and are conflicting with the lead vocal.",
  "strange reverb on slide gtr. voc up and down.. kick bass weak. tamb in ctr distracting. bg vocs too loud",
  "narrow mix lead vocal not integrated; too soft sometimes, too loud others, needs a mix BG's horribly, prosecutably mis-mixed slide electric out of balance; chorus guitar not integrated with big L-R ryth",
  "Just a little boring. Mono-ish. Lots of hi-hat...",
  "The record?!?",
  "Guitar lacks punch and the whole thing feels a bit quiet.",
  "mid range a bit muddy. Vocales can't cut through",
  "Sounds a bit messy, lacks separation.",
  "separated, voice masked by guitar",
  "flat, not sure about the vocal effect. Warm",
  "guitar and bass a bit loud, generally loud mid-low frequencies",
  "drum’s sound too loud",
  "this mix is unclear and the voice is not strong.",
  "Lead a little harsh and loud. not a bad balance.",
  "Slide guitar?? Way too hot. Tiny snare. Vocals needs to leveled out way more....Words sticking out like crazy. Cool effect on the prochorus",
  "overcompressed vocals",
  "left slide guitar is an akward place, too forward and dry. vocals sound aggressive, too much 4k or something. guitars could be more gutsy.",
  "lead vocal not integrated",
  "De-ess vocal. Vocal too loud. Drums need to sound bigger. You messed up the timing in the prechorus, voice is delayed from you plugin chain.",
  "Unbalanced. Demo? Interesting ideas for the real mix?",
  "Too much treble",
  "Like the right pan of rhythm guitar. Can hardly hear tambourine. Bass seems a little thin.",
  "Vocals are overly-compressed at times.",
  "could have less compression, too much effect on vocals on second part",
  "Now the slide guitar is too present and panned to left. It creates some separation, but is not appealing. The chorus in the voice in part B is too extreme.",
  "The vocals sound a bit piercing.",
  "the balance is not good",
  "Too much guitar, especially the one on the far right. Not enough snare, and too much hi-hat.",
  "Open mix, but aggressive highs, possibly too much master compression? Hi-hat is too loud, and there's not enough snare.",
  "The vocals sound quite sharp.",
  "More of a rock feel. The vocals sound watery, and the drum balance doesn't sound familiar. The vocals don't sound good, quite thin.",
  "I miss a bit of kick. I think there's a bit too much very low end in the bass. There's little definition in the low frequencies.",
  "Bit too bright and thin",
  "Too bright, snare sounds like it is clipping at times",
  "A lot of noise is shadowing this mix. It very badly interferes with the distorted guitars and any loud sound really. Sounds very harsh to the ears, not pleasant to listen to.",
  "acid - with character but crackling?",
  "Vocals have a weird EQ on it",
  "vocals too thin, out of place, disappear in the music, highs annoying",
  "drum，some noise in track，not comfortable",
  "music seemed coarse and false",
  "still separated.",
  "Way too much bass and too much hi-hat.",
  "Sounds quite dark.",
  "Too much bass! Vocals sound a bit dull. A lot of reverb on the guitars.",
  "Quite a bit of sub in the mix. The bass is too high, pushing everything away.",
  "A lot of low end, sounds muffled. It's difficult to discern the placement of bass and kick. Perhaps it was mixed in a space where low frequencies pose a challenge.",
  "The bass is really booming at a very low frequency. Quite disturbing. Also, the drums don't come through very well.",
  "Bass a bit too subby",
  "Missing the high end, too much bass",
  "I would appreciate some pannings, The guitar is too low",
  "Bass over-compressed. Too much hi-hat.",
  "very boomy mix (this is bad!). Vocals don't stand out, the bass masks most of the instrumentation, only the top end of the snare and cymbals manage to cut through.",
  "Too bright sounding maybe",
  "low sound range(?) is strong",
  "singer voice more miscible with music than track 0",
  "Big bottom end; borderline unruly but could be tweaked at mastering. Vocals a little bit lost, instrumental elements are mixed in a pleasant, unobtrusive manner.",
  "The guitar on the left demands too much attention.",
  "Omwille van de nadruk op elementen in het hoog, heeft deze mix haast geen mid informatie waardoor het geheel zwak klinkt. Plaatsing van de bas werkt goed, maar krijgt dan ook vrij spel omdat alle gitaren 'ondermixt' zijn. Een mix die meer op suggestie is gebaseerd dan concrete informatie.",
  "The mix sounds quite empty. Could use more body, not through the bass, but via other instruments.",
  "The drum sound doesn't really match the rest. Too much attack in the snare. Maybe this works well on a small monitoring system (PC speakers).",
  "The hi hat is harsh",
  "The voice is too low, the guitar should have a higher volume",
  "Harsh top end (heard a lot on HH and ride cymbal). The amount of compression applied (too much) squashes the sound. The mix does not have any air to breathe anymore. Vocals sound very thin and don't cut trough. Drums sound very thin as well (this is bad).",
  "thin image, guitar on its own - interesting",
  "thin and boxy and muddy, instruments not really discernible, drums too dry",
  "hi－hat too over",
  "Not mixed well, I can hear all the sound individually",
  "Bright mix, drums are weak and could use a dose of SSL G-series compression.",
  "In my opinion, the worst mix. I hear a lot of harshness in the snare. The kick is way too prominent. The balance between guitars and vocals is also off; the guitars often overpower the vocals. I also remember there being an acoustic guitar, but I won't be able to distinguish it.",
  "No nice low/low-mid in the mix; the bass drum sounds very flat, and the bassline disappears completely. Too much 800-2.5k in the mix, making it tiring to listen to.",
  "The vocals are drowned out by the guitars, which are too extreme left/right. It's the only one of the 7 where the bass drum comes through, but immediately too much.",
  "Vreemde EQ , gitaren luid , weinig top/open hoog. Weinig reverb.",
  "Don't like the kick. There's something in the low-mid that is disturbing. I miss some bass, it's not well-balanced with the kick. The snare doesn't sound good to me either. Guitars and vocals are well balanced. In this mix, the drum sound bothers me, which I consider a downside.",
  "Vocals are too buried in the mix. The balance is not quite right.",
  "Seems mixed by a guitarist. Kick and snare are quite loud. Vocals sit deep (perhaps due to the performance?)",
  "Drums a bit dry and guitar a bit loud",
  "Don't like the snare",
  "Guitars are too loud. Vocals are way too far back. The tonal balance is terrible.",
  "too wide and dry",
  "Unbalanced sound",
  "music too loud ,lack of texture,singer voice too weak",
  "No bass end at all. Mix balance is all off.",
  "This mixing sounds tiring because the voice of bass is a little high, I can't even hear the vocal clearly. And the rhythm is not consistent enough, so I think it's a bit poor.",
  "too separated .feel like the musical instrument performed in different place",
  "The guitars are a bit too prominent in my opinion, they are quite forward. It seems like the vocals sometimes have to compete with the guitars, as if they are working against each other. It makes it a bit tiring to listen to.",
  "I find the vocals sound quite dry and upfront in the mix. This clashes a bit with the guitars, which are also quite loud. There's a bit too much information in the 800-2k Hz range.",
  "The vocals don't really stand out in the mix, and there's too much hi-hat.",
  "Some things could be panned a bit more.",
  "The vocals have a strange midrange. Is there little compression on the vocals?",
  "A bit more drums. The song might be lacking some punch/low end.",
  "Not bad but vocals a bit low and a bit too much low-mid in the whole mix",
  "Not bad, cannot hear the acoustic guitar",
  "The voice should have a higher volume, the guitar seems to be too much filtered and compressed",
  "Too thin. Lacks some bass.",
  "Way too much reverb. All the focus and clarity is lost as a consequence. Vocals are diluted in it. This is a shame, the mix is decent otherwise.",
  "too much in front - bit flat",
  "vocals too dry",
  "low pitch sound too weak,lack of rhythm sensation",
  "the vocal is not clear.not highlighted"
]